src/test/jmeter/box_http1_volume.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Box HTTP Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <stringProp name="TestPlan.user_define_classpath">C:\Developer\Code\box-benchmark-framework\target\box-benchmark-framework-1.0.jar</stringProp>
    </TestPlan>
    <hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Parameters" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="thread.count" elementType="Argument">
            <stringProp name="Argument.name">thread.count</stringProp>
            <stringProp name="Argument.value">${__P(thread.count)}</stringProp>
            <stringProp name="Argument.desc">Number of simultaneous users</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="rampup" elementType="Argument">
            <stringProp name="Argument.name">rampup</stringProp>
            <stringProp name="Argument.value">${__P(rampup)}</stringProp>
            <stringProp name="Argument.desc">Ramp-up time for test</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="httpclient.version" elementType="Argument">
            <stringProp name="Argument.name">httpclient.version</stringProp>
            <stringProp name="Argument.value">${__P(httpclient.version)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="box.http.protocol" elementType="Argument">
            <stringProp name="Argument.name">box.http.protocol</stringProp>
            <stringProp name="Argument.value">${__P(box.http.protocol)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="box.base.domain" elementType="Argument">
            <stringProp name="Argument.name">box.base.domain</stringProp>
            <stringProp name="Argument.value">${__P(box.base.domain)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="box.files.path" elementType="Argument">
            <stringProp name="Argument.name">box.files.path</stringProp>
            <stringProp name="Argument.value">${__P(box.files.path)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="box.upload.domain" elementType="Argument">
            <stringProp name="Argument.name">box.upload.domain</stringProp>
            <stringProp name="Argument.value">${__P(box.upload.domain)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="box.upload.path" elementType="Argument">
            <stringProp name="Argument.name">box.upload.path</stringProp>
            <stringProp name="Argument.value">${__P(box.upload.path)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="box.folders.path" elementType="Argument">
            <stringProp name="Argument.name">box.folders.path</stringProp>
            <stringProp name="Argument.value">${__P(box.folders.path)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="box.eid" elementType="Argument">
            <stringProp name="Argument.name">box.eid</stringProp>
            <stringProp name="Argument.value">${__P(box.eid)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="max.folder.count" elementType="Argument">
            <stringProp name="Argument.name">max.folder.count</stringProp>
            <stringProp name="Argument.value">${__P(max.folder.count)}</stringProp>
            <stringProp name="Argument.desc">Maximum amount of folders to create</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="max.file.count" elementType="Argument">
            <stringProp name="Argument.name">max.file.count</stringProp>
            <stringProp name="Argument.value">${__P(max.file.count)}</stringProp>
            <stringProp name="Argument.desc">Maximum amount of files to create in each folder</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="sample.file.path" elementType="Argument">
            <stringProp name="Argument.name">sample.file.path</stringProp>
            <stringProp name="Argument.value">${__P(sample.file.path)}</stringProp>
            <stringProp name="Argument.desc">Path to the sample file</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="metadata.template.key" elementType="Argument">
            <stringProp name="Argument.name">metadata.template.key</stringProp>
            <stringProp name="Argument.value">${__P(metadata.template.key)}</stringProp>
            <stringProp name="Argument.desc">Key of the Metadata Template. Note that this is not the Display Name.</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="use.current.datetime" elementType="Argument">
            <stringProp name="Argument.name">use.current.datetime</stringProp>
            <stringProp name="Argument.value">${__P(use.current.datetime)}</stringProp>
            <stringProp name="Argument.desc">Set to true to automatically populate with current date.</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="base.folder.id" elementType="Argument">
            <stringProp name="Argument.name">base.folder.id</stringProp>
            <stringProp name="Argument.value">${__P(base.folder.id)}</stringProp>
            <stringProp name="Argument.desc">Base folder ID for creating JMeter folders and uploading files</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="file.mime.type" elementType="Argument">
            <stringProp name="Argument.name">file.mime.type</stringProp>
            <stringProp name="Argument.value">${__P(file.mime.type)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="file.download.path" elementType="Argument">
            <stringProp name="Argument.name">file.download.path</stringProp>
            <stringProp name="Argument.value">${__P(file.download.path)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="user.login" elementType="Argument">
            <stringProp name="Argument.name">user.login</stringProp>
            <stringProp name="Argument.value">${__P(user.login)}</stringProp>
            <stringProp name="Argument.desc">User email</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="box.config.path" elementType="Argument">
            <stringProp name="Argument.name">box.config.path</stringProp>
            <stringProp name="Argument.value">${__P(box.config.path)}</stringProp>
            <stringProp name="Argument.desc">Box App Client Id</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="max.cache.entries" elementType="Argument">
            <stringProp name="Argument.name">max.cache.entries</stringProp>
            <stringProp name="Argument.value">${__P(max.cache.entries)}</stringProp>
            <stringProp name="Argument.desc">Box App max cache entries</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="setUp Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </SetupThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="1. JSR223 - Load Props File" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">import org.apache.jmeter.services.FileServer;
import java.nio.file.*;
import java.nio.file.Paths;
import java.util.stream.Collectors;
import java.util.stream.Stream;


File propsFile = null;
try { 
	def path = FileServer.getFileServer().getDefaultBase();
	def separator = File.separator;
	def parentDir = Path.of(path).getParent();
	def customPropsDir = Path.of(parentDir.toString() + separator + &apos;custom_properties&apos;);
	log.info(&apos;Found props dir: &apos; + customPropsDir);
	List&lt;String&gt; results;
	
	 try (Stream&lt;Path&gt; walk = Files.walk(customPropsDir)) {
	 	results = walk
              .filter(p -&gt; !Files.isDirectory(p))   // not a directory
              .map(p -&gt; p.toString().toLowerCase()) // convert path to string
              .filter(f -&gt; f.startsWith(&apos;box-&apos;))
              .collect(Collectors.toList());        // collect all matched to a List
	}
  	log.info(&apos;Found result count &apos; + results.get(0))
   	propsFile = new File(results.get(0))
  	if(!propsFile.exists()) {
	   	throw FileNotFoundException(&apos;Box properties file NOT found!&apos;)
   	}
   	else {
   		log.info(&apos;Found props file: &apos; + propsFile.getAbsolutePath())
   		def box_properties = new Properties()
		box_properties.load(new FileInputStream(propsFile))
		box_properties.each { prop -&gt;
			String propKey = prop.getKey()
			String propValue = prop.getValue()
		    log.info(&apos;Found prop key:value &apos; + propKey + &apos;:&apos; + propValue)
		    vars.put(propKey, propValue)
		}
   	}
}
catch(Exception e)
{
	e.printStackTrace()
}
</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Main Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">stoptestnow</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${max.file.count}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${thread.count}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${rampup}</stringProp>
        <longProp name="ThreadGroup.start_time">1293887799000</longProp>
        <longProp name="ThreadGroup.end_time">1293887799000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.duration">${DURATION}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="2. SDK - Get Box Connection" enabled="true">
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="box.config.path" elementType="Argument">
                <stringProp name="Argument.name">box.config.path</stringProp>
                <stringProp name="Argument.value">${box.config.path}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="max.cache.entries" elementType="Argument">
                <stringProp name="Argument.name">max.cache.entries</stringProp>
                <stringProp name="Argument.value">${max.cache.entries}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="user.login" elementType="Argument">
                <stringProp name="Argument.name">user.login</stringProp>
                <stringProp name="Argument.value">${user.login}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">com.box.platform.jmeter.sampler.GetBoxConnection</stringProp>
        </JavaSampler>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="3. HTTP - Create Folder" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
	&quot;name&quot;: &quot;JMeter-HTTP1-Test-${__Random(0000,9999)}-${__time(yyyyMMdd-HHmmss)}&quot;,&#xd;
	&quot;parent&quot;: {&#xd;
		&quot;id&quot;: &quot;${base.folder.id}&quot;&#xd;
	}&#xd;
}&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${box.base.domain}</stringProp>
          <stringProp name="HTTPSampler.port">443</stringProp>
          <stringProp name="HTTPSampler.protocol">${box.http.protocol}</stringProp>
          <stringProp name="HTTPSampler.path">${box.folders.path}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${__property(box.access.token)}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor - Current Folder Id" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">current.folder.id</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.id</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>
        <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="6. HTTP - Upload + Add Metadata" enabled="true">
          <boolProp name="TransactionController.includeTimers">false</boolProp>
          <boolProp name="TransactionController.parent">true</boolProp>
        </TransactionController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="4. HTTP - Upload File" enabled="true">
            <elementProp name="HTTPsampler.Files" elementType="HTTPFileArgs">
              <collectionProp name="HTTPFileArgs.files">
                <elementProp name="${sample.file.path}" elementType="HTTPFileArg">
                  <stringProp name="File.mimetype">application/pdf</stringProp>
                  <stringProp name="File.path">${sample.file.path}</stringProp>
                  <stringProp name="File.paramname">file</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
              <collectionProp name="Arguments.arguments">
                <elementProp name="attributes" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&quot;name&quot;:&quot;${__Random(0000,9999)}-${__time(yyyyMMdd-HHmmss)}.TestFile.pdf&quot;, &quot;parent&quot;:{&quot;id&quot;:&quot;${current.folder.id}&quot;}}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                  <boolProp name="HTTPArgument.use_equals">true</boolProp>
                  <stringProp name="Argument.name">attributes</stringProp>
                  <stringProp name="HTTPArgument.content_type">multipart/form-data</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${box.upload.domain}</stringProp>
            <stringProp name="HTTPSampler.protocol">${box.http.protocol}</stringProp>
            <stringProp name="HTTPSampler.path">${box.upload.path}</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">true</boolProp>
            <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Authorization</stringProp>
                  <stringProp name="Header.value">Bearer ${__property(box.access.token)}</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
            <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor - Current File Id" enabled="true">
              <stringProp name="JSONPostProcessor.referenceNames">current.file.id</stringProp>
              <stringProp name="JSONPostProcessor.jsonPathExprs">$.entries[0].id</stringProp>
            </JSONPostProcessor>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="5. HTTP - Add Metadata" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
	&quot;documentid&quot;: &quot;1981290&quot;,&#xd;
	&quot;officialformtitle&quot;: &quot;MO W-4&quot;,&#xd;
	&quot;stateabbreviation&quot;: &quot;MO&quot;,&#xd;
	&quot;employercode1&quot;: 90050,&#xd;
	&quot;w4employeeid&quot;: &quot;125231&quot;,&#xd;
	&quot;ssn&quot;: &quot;825977777&quot;,&#xd;
	&quot;firstname&quot;: &quot;QUALITY&quot;,&#xd;
	&quot;lastname&quot;: &quot;ASSURANCE&quot;,&#xd;
	&quot;filingdate&quot;: &quot;01/01/0001&quot;,&#xd;
	&quot;filingtime&quot;: &quot;12:00:00&quot;,&#xd;
	&quot;creationdate&quot;: &quot;01/01/0001&quot;,&#xd;
	&quot;creationtime&quot;: &quot;12:00:00&quot;,&#xd;
	&quot;signaturenotes&quot;: &quot;Signed by QUALITY ASSURANCE @ 7/13/2022 8:55:30 AM&quot;,&#xd;
	&quot;datasourceid&quot;: &quot;1&quot;,&#xd;
	&quot;lastmodifieddatetime&quot;: &quot;1/1/0001 12:00:00 AM&quot;,&#xd;
	&quot;docid1&quot;: 983693204781,&#xd;
	&quot;pagenum1&quot;: 1&#xd;
}&#xd;
</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${box.base.domain}</stringProp>
            <stringProp name="HTTPSampler.protocol">${box.http.protocol}</stringProp>
            <stringProp name="HTTPSampler.path">${box.files.path}/${current.file.id}/metadata/enterprise_${box.eid}/${metadata.template.key}</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
            <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Authorization</stringProp>
                  <stringProp name="Header.value">Bearer ${__property(box.access.token)}</stringProp>
                </elementProp>
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="7. HTTP -  Download File" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${box.base.domain}</stringProp>
          <stringProp name="HTTPSampler.protocol">${box.http.protocol}</stringProp>
          <stringProp name="HTTPSampler.path">${box.files.path}/${current.file.id}/content</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${__property(box.access.token)}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatGraphVisualizer" testclass="ResultCollector" testname="Aggregate Graph" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>